src/app/controllers/authentications_controller.rb

  def create
    omniauth = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
    if authentication
      flash[:notice] = "Signed in successfully."
      sign_in_and_redirect(:user, authentication.user)
    else
      if current_user
        current_user.authentications.create(:provider => omniauth['provider'], :uid => omniauth['uid'])
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."provider" = 'twitter' AND "authentications"."uid" = '382806612' LIMIT 1
INSERT INTO "authentications" ("created_at", "provider", "uid", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 24 Sep 2012 05:01:45 UTC +00:00], ["provider", "twitter"], ["uid", "382806612"], ["updated_at", Mon, 24 Sep 2012 05:01:45 UTC +00:00], ["user_id", 6]]

  def destroy
    @authentication = current_user.authentications.find(params[:id])
    @authentication.destroy
---
SELECT "authentications".* FROM "authentications" WHERE "authentications"."user_id" = 6 AND "authentications"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "authentications" WHERE "authentications"."id" = ?  [["id", 1]]